Repository: c0ryd/Xo-So
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Vietnamese Lottery OCR
vi: Quét Xổ Số Việt Nam

# scanTicket
source: Scan a ticket
vi: Quét vé số

source: CURRENT RESULTS
vi: KẾT QUẢ HIỆN TẠI

source: Pending Results
vi: Đang Chờ Kết Quả

source: Winner Check Failed
vi: Kiểm Tra Trúng Thưởng Thất Bại

source: Processing image...
vi: Đang xử lý hình ảnh...

source: Ticket Details
vi: Chi Tiết Vé Số

source: Province
vi: Tỉnh/Thành

source: Ticket Number
vi: Số Vé

source: Draw Date
vi: Ngày Xổ

source: Region
vi: Vùng

source: 🎉 Congratulations! 🎉
vi: 🎉 Chúc Mừng! 🎉

# youWon
source: You won {amount} VND!
vi: Bạn đã trúng {amount} VND!

# matchedTiers
source: Matched Tiers: {tiers}
vi: Giải Trúng: {tiers}

# notAWinner
source: Not a winner this time
vi: Chưa trúng lần này

# betterLuckNextTime
source: Better luck next time! Keep playing!
vi: Chúc may mắn lần sau! Hãy tiếp tục chơi!

# resultsNotAvailable
source: Results for {province} are not available yet. You will be notified when results are available.
vi: Kết quả xổ số {province} chưa có. Bạn sẽ được thông báo khi có kết quả.

# drawingNotOccurred
source: This drawing has not occurred yet, you will receive a notification after the drawing has occurred.
vi: Kỳ xổ này chưa diễn ra, bạn sẽ nhận được thông báo sau khi có kết quả xổ số.

# errorOccurred
source: An error occurred. Please try again.
vi: Đã xảy ra lỗi. Vui lòng thử lại.

# cameraPermissionRequired
source: Camera permission is required to scan tickets
vi: Cần quyền truy cập camera để quét vé số

source: Logout
vi: Đăng Xuất

source: Settings
vi: Cài Đặt

source: Language
vi: Ngôn Ngữ

source: English
vi: Tiếng Anh

source: Vietnamese
vi: Tiếng Việt

# todaysDrawings
source: Results
vi: Kết Quả

source: Drawing Results
vi: Kết Quả Xổ Số

source: Coming Soon!
vi: Sắp Ra Mắt!

# ticketStored
source: Ticket stored successfully
vi: Đã lưu vé số thành công

# failedToStore
source: Failed to store ticket. Please try again.
vi: Lưu vé số thất bại. Vui lòng thử lại.

source: Scan Another
vi: Quét Vé Khác

source: Forgot Password?
vi: Quên Mật Khẩu?

source: Reset Password
vi: Đặt Lại Mật Khẩu

# enterEmailToReset
source: Enter your email address and we'll send you a link to reset your password.
vi: Nhập địa chỉ email của bạn và chúng tôi sẽ gửi liên kết đặt lại mật khẩu.

source: Send Reset Link
vi: Gửi Liên Kết Đặt Lại

# resetLinkSent
source: Password reset link sent! Check your email.
vi: Đã gửi liên kết đặt lại mật khẩu! Kiểm tra email của bạn.

source: Back to Sign In
vi: Quay Lại Đăng Nhập

# emailRequired
source: Email is required
vi: Email là bắt buộc

source: Sign In
vi: Đăng Nhập

source: Sign Up
vi: Đăng Ký

source: Create Account
vi: Tạo Tài Khoản

source: Email/Phone
vi: Email/Điện Thoại

# phone
source: Phone (+1234567890)
vi: Điện Thoại (+84123456789)

source: Password
vi: Mật Khẩu

source: Enter OTP
vi: Nhập Mã OTP

source: Send OTP
vi: Gửi OTP

source: Verify & Sign Up
vi: Xác Minh & Đăng Ký

source: Verify & Sign In
vi: Xác Minh & Đăng Nhập

source: ← Back
vi: ← Quay Lại

source: Resend OTP
vi: Gửi Lại OTP

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

# dontHaveAccount
source: Don't have an account?
vi: Chưa có tài khoản?

source: or continue with
vi: hoặc tiếp tục với

source: Continue with Apple
vi: Tiếp Tục Với Apple

source: Continue with Google
vi: Tiếp Tục Với Google

source: Signing in...
vi: Đang đăng nhập...

# pleaseEnterEmailPassword
source: Please enter both email and password
vi: Vui lòng nhập email và mật khẩu

# passwordMinLength
source: Password must be at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

# pleaseEnterPhoneNumber
source: Please enter a phone number
vi: Vui lòng nhập số điện thoại

# invalidPhoneNumber
source: Please enter a valid phone number (include country code like +1234567890)
vi: Vui lòng nhập số điện thoại hợp lệ (bao gồm mã quốc gia như +84123456789)

# pleaseEnterOtp
source: Please enter the verification code
vi: Vui lòng nhập mã xác minh

source: Sign in failed
vi: Đăng nhập thất bại

source: Sign up failed
vi: Đăng ký thất bại

source: My Tickets
vi: Vé Số Của Tôi

# scanTicketButton
source: Scan Ticket
vi: Quét Vé Số

source: Auto-Scanning...
vi: Đang Tự Động Quét...

source: Found
vi: Tìm Thấy

source: Stop Scanning
vi: Dừng Quét

source: Scan Results
vi: Kết Quả Quét

source: City
vi: Thành Phố

source: Date
vi: Ngày

source: Quantity
vi: Số Lượng

source: Done
vi: Hoàn Thành

source: Amazing!
vi: Tuyệt Vời!

# checkingWinner
source: Checking for winner...
vi: Đang kiểm tra trúng thưởng...

source: Not found
vi: Không tìm thấy

# todaysDrawingsTitle
source: Today's Drawings
vi: Kết Quả Hôm Nay

source: Provinces with drawings
vi: Tỉnh có xổ số

# noDrawingsScheduled
source: No drawings scheduled for this date
vi: Không có xổ số nào được lên lịch cho ngày này

source: Lottery Results
vi: Kết Quả Xổ Số

source: Drawing Scheduled
vi: Đã Lên Lịch Xổ

# resultsNotAvailableYet
source: Results Not Available
vi: Chưa Có Kết Quả

source: Loading...
vi: Đang tải...

# myTicketsTitle
source: My Tickets
vi: Vé Số Của Tôi

source: Total Winnings
vi: Tổng Tiền Thắng

source: Pending
vi: Đang Chờ

source: Special Prize
vi: Giải Đặc Biệt

source: First Prize
vi: Giải Nhất

source: Second Prize
vi: Giải Nhì

source: Third Prize
vi: Giải Ba

source: Fourth Prize
vi: Giải Tư

source: Fifth Prize
vi: Giải Năm

source: Sixth Prize
vi: Giải Sáu

source: Seventh Prize
vi: Giải Bảy

source: Eighth Prize
vi: Giải Tám

# drawingNotComplete
source: Drawing not yet complete
vi: Xổ số chưa hoàn thành

# drawingResultsAvailable
source: Drawing results will be available on this date
vi: Kết quả xổ số sẽ có vào ngày này

# noDrawingResults
source: No drawing results found for this date and province
vi: Không tìm thấy kết quả xổ số cho ngày và tỉnh này

source: No results available
vi: Không có kết quả

# noResultsForDate
source: No results available for this date
vi: Không có kết quả cho ngày này

source: ticket
vi: vé

source: tickets
vi: vé
